{  "site_name": "DevNest Team",
  "nav_home": "الرئيسية",
  "nav_about": "معلومات عنا",
  "nav_features": "الميزات",
  "nav_pricing": "الأسعار",
  "nav_dropdown": "المزيد",
  "nav_contact": "اتصل بنا",
  "hero_title": "حوّل فكرة تطبيقك إلى واقع ملموس",
  "hero_subtitle": "نحن فريق إبداعي متخصص في بناء تطبيقات جوال قوية وسهلة الاستخدام، تُحدث فرقاً حقيقياً في عالمك الرقمي.",
  "google_play_btn": "جوجل بلاي",
  "app_store_btn": "آب ستور",
  "about_us_heading": "عن فريقنا",
  "about_us_title": "نحوّل أفكارك إلى تطبيقات جوال قوية ومبتكرة",
  "about_us_p": "نحن فريق من المطورين الخبراء نتقن فن بناء تطبيقات الجوال. نقدم حلولاً شاملة وقابلة للتطوير، بدءاً من تصميم واجهات المستخدم وتجربة المستخدم الجذابة، وصولاً إلى بناء الواجهات الخلفية (Backend) المتينة باستخدام Laravel و Flutter. كما نتولى عملية نشر تطبيقاتك على جوجل بلاي – لنجعل تحويل أفكارك إلى تطبيقات جوال حقيقية أمراً سهلاً وميسراً.",
  "read_more_btn": "اكتشف المزيد",
  "service1_title": "تطوير تطبيقات الجوال",
  "service1_p": "نصمم ونبني تطبيقات أندرويد عالية الأداء باستخدام فلاتر (Flutter)، مصممة خصيصاً لرؤيتك وتطلعات جمهورك.",
  "service2_title": "واجهات خلفية (Backend) بـ Laravel",
  "service2_p": "نوفر تطوير واجهات خلفية قوية وقابلة للتوسع باستخدام Laravel، لدعم منطق تطبيقك وهياكل البيانات بكفاءة عالية.",
  "service3_title": "تصميم تجربة المستخدم وواجهاته (UI/UX)",
  "service3_p": "نقدم تصاميم جذابة وسهلة الاستخدام لضمان أفضل تجربة ممكنة للمستخدم على جميع الأجهزة.",
  "service4_title": "نشر التطبيقات",
  "service4_p": "نتولى كافة مراحل عملية رفع تطبيقك وتحسينه ليظهر بأفضل شكل على متجر جوجل بلاي.",
  "why_us_title": "لماذا تختار فريق ديفنيست؟",
  "why_us_subtitle": "نقدم حلولاً مبتكرة مصممة خصيصاً للشركات الناشئة والأعمال الطموحة التي تسعى للتوسع في عالم الجوال.",
  "feature1_title": "تطوير قائم على التعاون",
  "feature1_p": "نعمل معك مباشرة، من مرحلة التخطيط وحتى النشر، لضمان أن تطبيقك يحقق رؤيتك ويلبي احتياجات المستخدمين بدقة.",
  "feature2_title": "استراتيجية وتفكير إبداعي في التصميم",
  "feature2_p": "نعتمد على التفكير الإبداعي والتخطيط الاستراتيجي لتحديد أهم الميزات وتدفقات المستخدم التي تحقق أقصى فائدة.",
  "feature3_title": "من الفكرة إلى الإطلاق الناجح",
  "feature3_p": "من النماذج الأولية إلى الكود الجاهز للإنتاج – نضمن أن كل خطوة محسّنة ومختبرة، وجاهزة للإطلاق على جوجل بلاي.",
  "step1_title": "تواصل معنا",
  "step1_p": "اتصل بفريقنا وأخبرنا عن فكرة تطبيقك. سنحدد موعداً لمكالمة أولية لفهم أهدافك وتطلعاتك.",
  "step2_title": "تخطيط وبناء النماذج",
  "step2_p": "نصمم خارطة طريق واضحة ونماذج أولية لتطبيقك، لنحوّل فكرتك إلى تصور مرئي مع تخطيط استراتيجي دقيق.",
  "step3_title": "التطوير والإطلاق",
  "step3_p": "يقوم مطورونا بكتابة الكود، الاختبار، ومن ثم نشر تطبيقك، لضمان أداء عالي الجودة وإطلاق سلس وناجح.",
  "gallery_title": "تطبيقاتنا المميزة",
  "gallery_p": "تصفح مجموعتنا من التطبيقات واستكشف ما أنجزناه من حلول أنيقة ومبتكرة لمشاكل حقيقية.",
  "app_desc": "وصف موجز للتطبيق.",
  "view_details_btn": "عرض التفاصيل",
  "team_title": "أعضاء فريقنا",
  "team_p": "نحن فريق شغوف من المطورين والمصممين، نكرس جهودنا لتحويل الأفكار إلى تطبيقات مبتكرة وذات تأثير فعال.",
  "team_member1_name": "محمد المصطفى",
  "team_member1_role": "مطور الواجهة الخلفية (Backend)",
  "team_member1_quote": "مهندس واجهات خلفية ذو خبرة، يركز على بناء أنظمة ذكية، قابلة للتوسع، وآمنة للتطبيقات الحديثة.",
  "team_member2_name": "صهيب كامل",
  "team_member2_role": "مطور فلاتر (Flutter Developer)",
  "team_member2_quote": "متخصص في بناء تطبيقات الجوال متعددة المنصات، مع تركيز قوي على الأداء المتميز وتجربة المستخدم السلسة.",
  "team_member3_name": "مؤيد نجيب",
  "team_member3_role": "مطور فلاتر (Flutter Developer)",
  "team_member3_quote": "خبير في تصميم واجهات المستخدم المتجاوبة والهندسة المعمارية الفعالة للجوال، يقدم تجارب استخدام لا تشوبها شائبة عبر جميع الأجهزة.",
  "team_member4_name": "عز الدين ميشيه",
  "team_member4_role": "مصمم واجهة وتجربة المستخدم (UI/UX Designer)",
  "team_member4_quote": "مصمم إبداعي يبتكر واجهات جميلة وبديهية، ترتقي برحلة المستخدم وتجعلها أكثر إمتاعاً.",
  "faq_title": "الأسئلة الشائعة",
  "faq_p": "إجابات لأكثر الأسئلة تداولاً حول العمل مع ديفنيست وبناء تطبيق الجوال الخاص بك.",
  "faq_q1": "كم يستغرق تطوير تطبيق جوال؟",
  "faq_a1": "يختلف وقت التطوير بناءً على مدى تعقيد التطبيق وميزاته، ولكن معظم المشاريع تستغرق ما بين 4 إلى 10 أسابيع من مرحلة البدء وحتى الإطلاق.",
  "faq_q2": "هل تبنون تطبيقات أندرويد فقط أم تدعمون iOS أيضاً؟",
  "faq_a2": "نحن نستخدم فلاتر (Flutter)، وهو إطار عمل متعدد المنصات، مما يمكننا من بناء تطبيقات لكل من أندرويد و iOS من قاعدة كود واحدة.",
  "faq_q3": "هل يمكنكم مساعدتي في نشر التطبيق على جوجل بلاي أو آب ستور؟",
  "faq_a3": "نعم، نقدم دعماً كاملاً لعملية النشر، بما في ذلك إعداد الأصول، كتابة أوصاف المتجر، وإدارة عملية الإرسال.",
  "faq_q4": "هل أحتاج إلى تصاميم جاهزة قبل التواصل معكم؟",
  "faq_a4": "لا تقلق إذا لم يكن لديك! يمكن لفريق تصميم تجربة المستخدم وواجهاته (UI/UX) لدينا تصميم تطبيقك من الصفر، بناءً على هويتك البصرية وجمهورك المستهدف.",
  "faq_q5": "ما هي التقنيات التي تستخدمونها لتطوير الواجهة الخلفية (Backend)؟",
  "faq_a5": "نحن نستخدم Laravel، وهو إطار عمل PHP قوي، لبناء واجهات برمجة تطبيقات (APIs) قابلة للتوسع، آمنة، وعالية الأداء لتطبيقات الجوال الخاصة بك.",
  "faq_q6": "كم تبلغ تكلفة بناء تطبيق مع ديفنيست؟",
  "faq_a6": "تعتمد الأسعار على الميزات المطلوبة وتعقيد تطبيقك. نقدم باقات مرنة تناسب الشركات الناشئة والأعمال القائمة – تواصل معنا للحصول على عرض سعر مجاني.",
  "faq_q7": "ما نوع الدعم الذي تقدمونه بعد تسليم التطبيق؟",
  "faq_a7": "نقدم 6 أشهر من الصيانة المجانية بعد التسليم. يتضمن ذلك إصلاح الأخطاء، التحديثات البسيطة، وضمان عمل تطبيقك بسلاسة مع إصدارات أنظمة التشغيل الجديدة.",
  "faq_q8": "هل يمكنني تحديث التطبيق لاحقاً بميزات جديدة؟",
  "faq_a8": "بالتأكيد! نحن نبني التطبيقات مع الأخذ في الاعتبار قابلية التوسع، لذا يمكنك دائماً إضافة ميزات أو تحسينات جديدة في الإصدارات المستقبلية.",
  "faq_q9": "هل توقعون اتفاقيات عدم إفشاء (NDA) لحماية فكرة تطبيقي؟",
  "faq_a9": "قطعاً. يسعدنا توقيع اتفاقية عدم إفشاء للحفاظ على فكرة تطبيقك سرية ومحمية تماماً.",
  "faq_q10": "من يملك الكود بعد بناء التطبيق؟",
  "faq_a10": "أنت المالك. بمجرد اكتمال المشروع وتسديد الدفعة، ستمتلك الملكية الكاملة للكود المصدري وجميع المنتجات النهائية.",
  "faq_q11": "هل يمكنكم إعادة تصميم أو ترقية تطبيق موجود؟",
  "faq_a11": "نعم، يمكننا تحليل تطبيقك الحالي وتقديم تحسينات لواجهة المستخدم وتجربته (UI/UX)، ترقيات في الأداء، أو إعادة بناء كاملة حسب الحاجة.",
  "faq_q12": "ما هو سير عمل التطوير لديكم؟",
  "faq_a12": "نحن نتبع سير عمل واضح ومنظم: اكتشاف → تصميم → تطوير → اختبار → إطلاق → دعم. ستكون جزءاً أساسياً ومشاركاً في كل مرحلة رئيسية.",
  "contact_title": "تواصل معنا",
  "contact_p": "لا تتردد في التواصل معنا لأي أسئلة أو استفسارات. نحن هنا لمساعدتك دائماً!",
  "call_us": "اتصل بنا",
  "email_us": "راسلنا بالبريد الإلكتروني",
  "form_name_placeholder": "اسمك الكامل",
  "form_email_placeholder": "بريدك الإلكتروني",
  "form_subject_placeholder": "الموضوع",
  "form_message_placeholder": "رسالتك",
  "form_send_btn": "أرسل الرسالة",
  "footer_p": "نقدم حلولاً موثوقة لمساعدتك على تحقيق أهدافك بكفاءة ويسر.",
  "footer_copyright": "© حقوق النشر محفوظة لفريق ديفنيست",
  "footer_credits": "صمم بواسطة محمد المصطفى"
}