{
  "site_name": "DevNest Team",
  "nav_home": "Home",
  "nav_about": "About",
  "nav_language": "Language",
  "nav_features": "Features",
  "nav_pricing": "Pricing",
  "nav_dropdown": "Dropdown",
  "nav_contact": "Contact",
  "hero_title": "Turn Your App Idea into Reality",
  "hero_subtitle": "We’re a creative team dedicated to building powerful, user-friendly mobile apps that make an impact.",
  "google_play_btn": "Google Play",
  "app_store_btn": "App Store",
  "about_us_heading": "About Us",
  "about_us_title": "We Turn Ideas into Powerful Mobile Applications",
  "about_us_p": "We are a team of expert developers specializing in mobile app development. From designing stunning UI/UX to building robust backends with Laravel and Flutter, we offer complete, scalable solutions. We also handle publishing to Google Play — turning your ideas into real-world mobile apps has never been easier.",
  "read_more_btn": "Read More",
  "service1_title": "Mobile App Development",
  "service1_p": "We build high-performance Android applications using Flutter, tailored to your vision and audience.",
  "service2_title": "Backend with Laravel",
  "service2_p": "Robust and scalable backend development using Laravel to support any app logic or data structure.",
  "service3_title": "UI/UX Design",
  "service3_p": "Visually appealing, user-friendly designs to ensure the best user experience across all devices.",
  "service4_title": "App Publishing",
  "service4_p": "We handle the entire process of uploading and optimizing your app for Google Play Store.",
  "why_us_title": "Why Choose DevNest?",
  "why_us_subtitle": "We offer innovative solutions tailored for startups and businesses ready to scale in the mobile world.",
  "feature1_title": "Collaborative Development",
  "feature1_p": "Work directly with our team — from planning to deployment — to ensure your app matches your vision and user needs.",
  "feature2_title": "Strategy & Design Thinking",
  "feature2_p": "We use creative whiteboarding and strategic thinking to define features and user flows that matter most.",
  "feature3_title": "Design to Deployment",
  "feature3_p": "From mockups to production-ready code — we ensure every step is optimized, tested, and launch-ready on Google Play.",
  "step1_title": "Get in Touch",
  "step1_p": "Contact our team and tell us about your app idea. We’ll schedule a discovery call to understand your goals.",
  "step2_title": "Plan & Prototype",
  "step2_p": "We’ll craft a roadmap and wireframe to bring your concept to life with visual clarity and strategic planning.",
  "step3_title": "Build & Launch",
  "step3_p": "Our developers code, test, and publish your app, ensuring quality performance and smooth deployment.",
  "index_gallery_title": "Our Applications",
  "index_gallery_p": "Swipe through our apps and explore what we’ve created to solve real problems with elegant solutions.",
  "app_desc": "Description for the application.",
  "view_details_btn": "View Details",
  "team_title": "Team Members",
  "team_p": "We are a passionate team of developers and designers turning ideas into innovative, high-impact applications.",
  "team_member1_name": "Mohammed Almostfa",
  "team_member1_role": "Backend Developer",
  "team_member1_quote": "Back-End Web Developer with over a year of hands-on experience building dynamic and robust web applications using PHP, Laravel, and MySQL. Proficient in applying SOLID principles and best practices in web security, I deliver high-performance solutions aligned with technical and business objectives. Passionate about continuous learning and staying up-to-date with the latest technologies to ensure project success.",
  "team_member2_name": "Sohiab Kamel",
  "team_member2_role": "Flutter Developer",
  "team_member2_quote": "Passionate software developer with hands-on experience in mobile app development using Flutter, and backend development using Laravel and Firebase. Skilled in analyzing requirements and transforming them into functional, user-friendly applications. Strong in teamwork, data management, and API integration. Always eager to learn and stay up-to-date with modern technologies.",
  "team_member3_name": "Moayyad Nagib",
  "team_member3_role": "Flutter Developer",
  "team_member3_quote": "Expert in responsive UI and efficient mobile architecture, delivering seamless experiences across devices.",
  "team_member4_name": "Azzddine Miche",
  "team_member4_role": "UI/UX Designer",
  "team_member4_quote": "Creative designer crafting beautiful and intuitive interfaces that elevate the user journey.",
  "faq_title": "Frequently Asked Questions",
  "faq_p": "Answers to the most common questions about working with DevNest and building your mobile app.",
  "faq_q1": "How long does it take to develop a mobile app?",
  "faq_a1": "Development time varies depending on the complexity of the app, but most projects take between 4 to 10 weeks from start to launch.",
  "faq_q2": "Do you only build Android apps or also iOS?",
  "faq_a2": "We use Flutter, a cross-platform framework, which allows us to build apps for both Android and iOS from a single codebase.",
  "faq_q3": "Can you help me publish the app on Google Play or App Store?",
  "faq_a3": "Yes, we offer complete publishing support including preparing assets, writing store descriptions, and managing the submission process.",
  "faq_q4": "Do I need to have designs before I contact you?",
  "faq_a4": "No worries if you don’t — our UI/UX team can design your app from scratch based on your brand and target audience.",
  "faq_q5": "What technologies do you use for backend development?",
  "faq_a5": "We use Laravel, a powerful PHP framework, to build scalable, secure, and performant APIs for your mobile applications.",
  "faq_q6": "How much does it cost to build an app with DevNest?",
  "faq_a6": "Pricing depends on the features and complexity of your app. We offer flexible packages for startups and businesses — contact us for a free quote.",
  "faq_q7": "What kind of support do you offer after the app is delivered?",
  "faq_a7": "We provide 6 months of free maintenance after delivery. This includes bug fixes, minor updates, and ensuring your app runs smoothly on new OS versions.",
  "faq_q8": "Can I update the app later with new features?",
  "faq_a8": "Yes! We build apps with scalability in mind, so you can always add new features or improvements in future versions.",
  "faq_q9": "Do you sign NDAs to protect my app idea?",
  "faq_a9": "Absolutely. We’re happy to sign a Non-Disclosure Agreement to keep your app idea secure and confidential.",
  "faq_q10": "Who owns the code after the app is built?",
  "faq_a10": "You do. Once the project is complete and payment is made, you will have full ownership of the source code and all deliverables.",
  "faq_q11": "Can you redesign or upgrade an existing app?",
  "faq_a11": "Yes, we can analyze your current app and offer UI/UX improvements, performance upgrades, or complete rebuilds as needed.",
  "faq_q12": "What’s your development process like?",
  "faq_a12": "We follow a clear workflow: discovery → design → development → testing → launch → support. You’ll be involved in every key step.",
  "contact_title": "Contact Us",
  "contact_p": "Feel free to reach out to us with any questions or inquiries. We're here to help!",
  "call_us": "Call Us",
  "email_us": "Email Us",
  "form_name_placeholder": "Your Name",
  "form_email_placeholder": "Your Email",
  "form_subject_placeholder": "Subject",
  "form_message_placeholder": "Message",
  "form_send_btn": "Send Message",
  "footer_p": "We provide reliable solutions to help you achieve your goals efficiently and effortlessly.",
  "footer_copyright": "© Copyright DevNest Team All Rights Reserved",
  "footer_credits": "Designed by Mohammed Almostfa",
  "nav_language_dropdown": "Language",
  "gallery_title": "Gallery",
  "gallery_p": "Browse screenshots from our app to explore its interface and features.",
  "chatbox_overview_title": "ChatBox Overview",
  "chatbox_section_heading": "ChatBox Application Overview",
  "chatbox_section_subtitle": "A quick overview of the app features, platform support, and development details.",
  "chatbox_app_name": "📱 App Name: ChatBox",
  "chatbox_app_description": "ChatBox is a smart, modern messaging app designed to keep you connected with friends through seamless chat and photo sharing—anytime, anywhere.",
  "chatbox_launch_date": "📅 Launch Date: August 2025",
  "chatbox_platforms": "💻 Platforms: Android, iOS",
  "chatbox_status": "🛠️ Status: Production Ready",
  "chatbox_technologies": "🧰 Technologies: Flutter, Firebase",
  "chatbox_features_heading": "Key Features:",
  "chatbox_feature1": "Real-time messaging in private or group chats",
  "chatbox_feature2": "High-quality photo sharing within conversations",
  "chatbox_feature3": "Photo status updates to creatively share moments",
  "chatbox_feature4": "Dark and light mode for personalized experience",
  "chatbox_feature5": "Clean, user-friendly interface for smooth navigation",
  "chatbox_final_note": "ChatBox delivers a dynamic and expressive messaging experience, empowering users to stay connected and communicate creatively with complete control and ease.",
  "ecommerce_overview_title": "E-Commerce Application Overview",
  "ecommerce_section_heading": "E-Commerce Application Overview",
  "ecommerce_section_subtitle": "A quick overview of the app features, platform support, and development details.",
  "ecommerce_app_name": "🛒 App Name: E-Commerce",
  "ecommerce_app_description": "E-Commerce is a comprehensive shopping app designed to streamline the online buying experience.",
  "ecommerce_launch_date": "📅 Launch Date: August 2025",
  "ecommerce_platforms": "💻 Platforms: Android, iOS",
  "ecommerce_status": "🛠️ Status: In Development (50% Complete)",
  "ecommerce_technologies": "🧰 Technologies: Flutter, Firebase",
  "ecommerce_features_heading": "Key Features:",
  "ecommerce_feature1": "Main Screen with Categories: Visually organized product categories for easy Browse.",
  "ecommerce_feature2": "Multi-Address Support: Add and manage multiple delivery addresses, assign orders or items individually.",
  "ecommerce_feature3": "Shopping Cart: Full-featured cart with product info, quantities, and persistent content across sessions.",
  "ecommerce_feature4": "Delivery Tracking on Map: Real-time order tracking with interactive maps and ETA.",
  "ecommerce_feature5": "Promo Codes: Apply and manage discounts via promo codes.",
  "ecommerce_feature6": "Favorite Items: Wishlist system for easy access to saved items across devices.",
  "ecommerce_final_note": "E-Commerce delivers a smooth, modern shopping experience, combining performance and convenience in one intuitive app.",
  "lista_overview_title": "Lista App Overview",
  "lista_section_heading": "Lista App Overview",
  "lista_section_subtitle": "Manage your tasks and goals with Lista - your smart personal planner.",
  "lista_app_name": " App Name: Lista",
  "lista_app_description": "Lista is a sleek, easy-to-use productivity app for managing to-do lists, routines, and reminders.",
  "lista_launch_date": "📅 Launch Date: September 2025",
  "lista_platforms": "💻 Platforms: Android, iOS",
  "lista_status": "🛠️ Status: Production Ready",
  "lista_technologies": "🧰 Technologies: Flutter",
  "lista_features_heading": "Key Features:",
  "lista_feature1": "Create and manage task lists efficiently",
  "lista_feature2": "Daily reminders and notifications",
  "lista_feature3": "Beautiful calendar integration",
  "lista_feature4": "Sync across multiple devices",
  "lista_feature5": "Minimal and distraction-free design",
  "lista_final_note": "Lista helps you stay focused and organized with a clean interface, intuitive controls, and reliable task tracking.",
  "ogb_overview_title": "OBG Overview",
  "ogb_section_heading": "OBG Application Overview",
  "ogb_section_subtitle": "An overview of the app's purpose, features, and development highlights.",
  "ogb_app_name": " App Name: OBG (Old But Gold)",
  "ogb_app_description": "OBG is a user-friendly mobile application designed to help people easily sell their pre-owned items.",
  "ogb_launch_date": " Launch Date: August 2025",
  "ogb_platforms": " Platforms: Android, iOS",
  "ogb_status": " Status: In Development (50% Complete)",
  "ogb_technologies": " Technologies: Flutter, Firebase, Laravel, MySql",
  "ogb_features_heading": "Key Features:",
  "ogb_feature1": "Photo Upload: Effortlessly upload photos of your old items to attract potential buyers.",
  "ogb_feature2": "Real-Time Chat: Engage in direct conversations with buyers and sellers to negotiate deals and ask questions.",
  "ogb_feature3": "Nearby Listings: Discover items from sellers in your local area for a more relevant and convenient shopping experience.",
  "ogb_feature4": "Advanced Search: Quickly find what you need by searching for items by category or keyword.",
  "ogb_final_note": "OBG makes selling and buying second-hand goods simple, fast, and community-focused—all in just a few taps.",
  "wasselni_overview_title": "Wasalni Overview",
  "wasselni_section_heading": "Wasalni Application Overview",
  "wasselni_section_subtitle": "A comprehensive look at Wasalni, a smart delivery solution.",
  "wasselni_app_name": "📦 App Name: Wasalni",
  "wasselni_app_description": "Wasalni is a smart and efficient delivery app that connects users with nearby drivers for fast and reliable transportation of goods and parcels. Users can place delivery requests, track orders in real time, and pay on delivery or through digital methods.",
  "wasselni_launch_date": "📅 Launch Date: August 2025",
  "wasselni_platforms": "💻 Platforms: Android, iOS",
  "wasselni_status": "🛠️ Status: In Development (90% Complete)",
  "wasselni_technologies": "🧰 Technologies: Flutter, Firebase, Laravel, MySQL, Google Maps API",
  "wasselni_development_info": "Development & Technologies:",
  "wasselni_development_details": "The app was developed using Flutter for a consistent cross-platform experience on both Android and iOS, and powered by a Laravel and Firebase backend for real-time notifications, user management, and secure data handling. Google Maps integration allows for accurate location tracking and route optimization.",
  "wasselni_ui_note": "With a clean user interface and dedicated dashboards for drivers and store owners, Wasalni offers a seamless delivery experience for both senders and couriers.",
  "wasselni_features_heading": "Key Features:",
  "wasselni_feature1": "User and driver registration",
  "wasselni_feature2": "Order creation and assignment",
  "wasselni_feature3": "Real-time tracking with maps",
  "wasselni_feature4": "Instant push notifications",
  "wasselni_feature5": "Ratings and reviews system",
  "wasselni_feature6": "Multiple payment options (cash on delivery, digital)",
  "wasselni_feature7": "Multilingual support",
  "mado_overview_title": "Mado Application Overview",
  "mado_section_heading": "Mado Application Overview",
  "mado_section_subtitle": "A quick overview of Mado's features, platform support, and development details.",
  "mado_app_name": "📚 App Name: Mado",
  "mado_app_description": "Mado is an interactive educational application designed to enhance learning through subject-based organization and collaborative features.",
  "mado_launch_date": "📅 Launch Date: September 2025",
  "mado_platforms": "💻 Platforms: Android, iOS",
  "mado_status": "🛠️ Status: In Development",
  "mado_technologies": "🧰 Technologies: Flutter",
  "mado_features_heading": "Key Features:",
  "mado_feature1": "Subject Categorization: Study materials organized by subjects with multiple lessons.",
  "mado_feature2": "Lesson Videos: Clear, explanatory videos accompanying each lesson.",
  "mado_feature3": "Practice Activities: Engaging activities to reinforce knowledge after videos.",
  "mado_feature4": "Community Interaction: Share activities and receive feedback within the Mado community.",
  "mado_feature5": "Collaborative Learning: Promote discussion and engagement among users.",
  "mado_final_note": "Mado combines structured education with social learning elements, making it an ideal platform for students seeking a more collaborative and engaging study experience."
}