{
  "site_name": "DevNest Team",
  "nav_home": "Home",
  "nav_about": "About Us",
  "nav_language": "Language",
  "nav_features": "Features",
  "nav_pricing": "Pricing",
  "nav_dropdown": "Dropdown",
  "nav_contact": "Contact",
  "hero_title": "Bring Your App Idea to Life",
  "hero_subtitle": "We are a creative team dedicated to building powerful, user-friendly mobile apps that make a lasting impact.",
  "google_play_btn": "Google Play",
  "app_store_btn": "App Store",
  "about_us_heading": "About Us",
  "about_us_title": "We Transform Ideas into Powerful Mobile Applications",
  "about_us_p": "We are a team of expert developers specializing in mobile app development. From designing stunning UI/UX to building robust backends with Laravel and Flutter, we offer end-to-end, scalable solutions. We also manage the publishing process to the Google Play Store, making it easier than ever to turn your vision into a reality.",
  "read_more_btn": "Read More",
  "service1_title": "Mobile App Development",
  "service1_p": "We build high-performance Android and iOS applications using Flutter, tailored to your vision and target audience.",
  "service2_title": "Robust Backend with Laravel",
  "service2_p": "We develop secure and scalable backends using Laravel to power any application logic or data architecture.",
  "service3_title": "UI/UX Design",
  "service3_p": "We create visually stunning and intuitive designs to ensure the best possible user experience on all devices.",
  "service4_title": "App Store Publishing",
  "service4_p": "We handle the entire process of uploading, optimizing, and launching your app on the Google Play Store.",
  "why_us_title": "Why Choose DevNest?",
  "why_us_subtitle": "We deliver innovative solutions tailored for startups and businesses poised for growth in the mobile landscape.",
  "feature1_title": "Collaborative Partnership",
  "feature1_p": "Work directly with our team from concept to launch, ensuring your app perfectly aligns with your vision and user needs.",
  "feature2_title": "Strategic Design Thinking",
  "feature2_p": "We utilize creative brainstorming and strategic planning to define the features and user flows that matter most.",
  "feature3_title": "End-to-End Execution",
  "feature3_p": "From mockups to production-ready code, we ensure every stage is optimized, tested, and prepared for a successful launch.",
  "step1_title": "Get in Touch",
  "step1_p": "Reach out to our team with your app idea. We'll schedule a discovery call to fully understand your goals and requirements.",
  "step2_title": "Plan & Prototype",
  "step2_p": "We'll craft a detailed roadmap and interactive prototypes to bring your concept to life with strategic clarity.",
  "step3_title": "Develop & Launch",
  "step3_p": "Our developers build, test, and publish your app, guaranteeing high-quality performance and a seamless deployment.",
  "index_gallery_title": "Our Portfolio",
  "index_gallery_p": "Browse through our collection of apps and discover how we create elegant solutions to solve real-world problems.",
  "app_desc": "Application Description.",
  "view_details_btn": "View Details",
  "team_title": "Meet Our Team",
  "team_p": "We are a passionate team of developers and designers dedicated to transforming ideas into innovative, high-impact applications.",
  "team_member1_name": "Mohammed Almostfa",
  "team_member1_role": "Backend Developer",
  "team_member1_quote": "A back-end web developer with over a year of hands-on experience building dynamic and robust web applications using PHP, Laravel, and MySQL. Proficient in applying SOLID principles and web security best practices, I deliver high-performance solutions that align with both technical and business objectives. I am passionate about continuous learning and staying current with the latest technologies to ensure project success.",
  "team_member2_name": "Sohiab Kamel",
  "team_member2_role": "Flutter Developer",
  "team_member2_quote": "A passionate software developer with practical experience in mobile app development using Flutter and backend development with Laravel and Firebase. Skilled in analyzing requirements and transforming them into functional, user-friendly applications. A strong team player with expertise in data management and API integration, I am always eager to learn and adapt to modern technologies.",
  "team_member3_name": "Moayyad Nagib",
  "team_member3_role": "Flutter Developer",
  "team_member3_quote": "A Flutter Developer with extensive experience in building beautiful, high-performance mobile applications. My journey in technology is driven by a relentless curiosity and a commitment to lifelong learning. I specialize in crafting seamless user experiences and leveraging Flutter's power to create cross-platform solutions that exceed client expectations. With a solid foundation in Dart and a keen eye for design, I enjoy turning complex problems into elegant, functional apps.",
  "team_member4_name": "Azzddine Miche",
  "team_member4_role": "UI/UX Designer",
  "team_member4_quote": "A UI/UX designer by passion, I am dedicated to creating meaningful products that solve real user problems and deliver genuine, impactful value to the world. I believe that design is the intersection of art, communication, and business—a space where everyone wins and people's lives are truly improved.",
  "faq_title": "Frequently Asked Questions",
  "faq_p": "Find answers to the most common questions about partnering with DevNest to build your mobile application.",
  "faq_q1": "How long does it take to develop a mobile app?",
  "faq_a1": "The development timeline depends on the app's complexity, but a typical project takes between 4 to 10 weeks from conception to launch.",
  "faq_q2": "Do you develop for iOS as well as Android?",
  "faq_a2": "Yes. We use Flutter, a cross-platform framework, which allows us to build and maintain apps for both Android and iOS from a single codebase.",
  "faq_q3": "Can you handle publishing the app to the app stores?",
  "faq_a3": "Absolutely. We offer complete publishing support, including preparing store assets, writing compelling descriptions, and managing the submission process.",
  "faq_q4": "Do I need to have a design ready before contacting you?",
  "faq_a4": "Not at all. Our talented UI/UX team can design your app from the ground up, tailored to your brand identity and target audience.",
  "faq_q5": "What backend technologies do you use?",
  "faq_a5": "We primarily use Laravel, a powerful PHP framework, to build scalable, secure, and high-performance APIs for your mobile applications.",
  "faq_q6": "How much does it cost to build an app with DevNest?",
  "faq_a6": "Pricing is based on the specific features and complexity of your app. We offer flexible packages for startups and established businesses. Contact us for a free, no-obligation quote.",
  "faq_q7": "What kind of post-launch support do you offer?",
  "faq_a7": "We provide a 6-month complimentary maintenance period after launch. This includes bug fixes, minor updates, and ensuring compatibility with new OS versions.",
  "faq_q8": "Can I add new features to the app later?",
  "faq_a8": "Yes! We build our applications with scalability in mind, making it easy to add new features and improvements in future updates.",
  "faq_q9": "Do you sign Non-Disclosure Agreements (NDAs)?",
  "faq_a9": "Of course. We are happy to sign an NDA to ensure your intellectual property and app idea remain secure and confidential.",
  "faq_q10": "Who owns the source code after the project is completed?",
  "faq_a10": "You do. Upon final payment and project completion, you will receive full ownership of the source code and all related assets.",
  "faq_q11": "Can you redesign or upgrade an existing application?",
  "faq_a11": "Yes, we can analyze your current app to propose UI/UX enhancements, performance upgrades, or a complete rebuild to meet your new goals.",
  "faq_q12": "What does your development process look like?",
  "faq_a12": "We follow a transparent and structured workflow: Discovery → Design → Development → Testing → Launch → Support. We ensure you are involved and informed at every key stage.",
  "contact_title": "Contact Us",
  "contact_p": "Have a question or an idea to discuss? Feel free to reach out. We're here to help you succeed.",
  "call_us": "Call Us",
  "email_us": "Email Us",
  "form_name_placeholder": "Your Name",
  "form_email_placeholder": "Your Email",
  "form_subject_placeholder": "Subject",
  "form_message_placeholder": "Message",
  "form_send_btn": "Send Message",
  "footer_p": "We provide reliable and innovative solutions to help you achieve your business goals with efficiency and excellence.",
  "footer_copyright": "© Copyright DevNest Team. All Rights Reserved",
  "footer_credits": "Designed by Mohammed Almostfa",
  "nav_language_dropdown": "Language",
  "gallery_title": "Gallery",
  "gallery_p": "Browse through screenshots of our application to explore its features and interface.",
  "chatbox_section_heading": "ChatBox Application",
  "chatbox_section_subtitle": "An overview of the app's features, platform support, and development details.",
  "Chatbox_app_desc": "ChatBox is a modern, intelligent messaging app designed to keep you connected with friends through seamless chat and photo sharing.",
  "chatbox_app_description": "ChatBox is a modern, intelligent messaging app designed to keep you connected with friends through seamless chat and photo sharing—anytime, anywhere.",
  "chatbox_launch_date": "📅 Launch Date: August 2025",
  "chatbox_platforms": "💻 Platforms: Android, iOS",
  "chatbox_status": "🛠️ Status: Production-Ready",
  "chatbox_technologies": "🧰 Technologies: Flutter, Firebase",
  "chatbox_features_heading": "Key Features:",
  "chatbox_feature1": "Real-time messaging in private and group chats.",
  "chatbox_feature2": "High-quality photo sharing within conversations.",
  "chatbox_feature3": "Creative photo status updates to share your moments.",
  "chatbox_feature4": "Personalized experience with Dark and Light modes.",
  "chatbox_feature5": "Clean, user-friendly interface for effortless navigation.",
  "chatbox_final_note": "ChatBox delivers a dynamic and expressive messaging experience, empowering users to communicate creatively and stay connected with ease.",
  "ecommerce_section_heading": "E-Commerce Application",
  "ecommerce_section_subtitle": "An overview of the app's features, platform support, and development details.",
  "ecommerce_app_desc": "A comprehensive shopping app designed to streamline the online buying experience from start to finish.",
  "ecommerce_app_description": "A comprehensive shopping app designed to streamline the online buying experience from start to finish.",
  "ecommerce_launch_date": "📅 Launch Date: August 2025",
  "ecommerce_platforms": "💻 Platforms: Android, iOS",
  "ecommerce_status": "🛠️ Status: In Development (50% Complete)",
  "ecommerce_technologies": "🧰 Technologies: Flutter, Firebase",
  "ecommerce_features_heading": "Key Features:",
  "ecommerce_feature1": "Categorized Home Screen: Visually organized product categories for easy Browse.",
  "ecommerce_feature2": "Multi-Address Support: Add and manage multiple delivery addresses for different orders.",
  "ecommerce_feature3": "Advanced Shopping Cart: A full-featured cart that saves products, quantities, and persists across sessions.",
  "ecommerce_feature4": "Live Delivery Tracking: Real-time order tracking on an interactive map with ETA.",
  "ecommerce_feature5": "Promo Code System: Easily apply and manage discounts with promotional codes.",
  "ecommerce_feature6": "Favorites/Wishlist: Save items for later and access your wishlist across all devices.",
  "ecommerce_final_note": "E-Commerce delivers a smooth, modern shopping experience, combining performance and convenience in one intuitive app.",
  "lista_section_heading": "Lista Application",
  "lista_section_subtitle": "An overview of the app's features, platform support, and development details.",
  "lista_app_desc": "Lista is a sleek, intuitive productivity app for managing to-do lists, daily routines, and important reminders.",
  "lista_app_description": "Lista is a sleek, intuitive productivity app for managing to-do lists, daily routines, and important reminders.",
  "lista_launch_date": "📅 Launch Date: September 2025",
  "lista_platforms": "💻 Platforms: Android, iOS",
  "lista_status": "🛠️ Status: Production-Ready",
  "lista_technologies": "🧰 Technologies: Flutter",
  "lista_features_heading": "Key Features:",
  "lista_feature1": "Efficiently create and manage task lists.",
  "lista_feature2": "Set daily reminders and notifications.",
  "lista_feature3": "Beautiful and functional calendar integration.",
  "lista_feature4": "Seamlessly sync your tasks across multiple devices.",
  "lista_feature5": "Minimalist, distraction-free design to help you focus.",
  "lista_final_note": "Lista helps you stay organized and focused with a clean interface, intuitive controls, and reliable task management.",
  "ogb_section_heading": "OGB Application Overview",
  "ogb_section_subtitle": "A summary of the app's purpose, features, and key development highlights.",
  "ogb_app_desc": "OGB is a user-friendly mobile marketplace designed to help people easily sell their pre-owned items.",
  "ogb_app_description": "OGB is a user-friendly mobile marketplace designed to help people easily sell their pre-owned items.",
  "ogb_launch_date": "📅 Launch Date: August 2025",
  "ogb_platforms": "💻 Platforms: Android, iOS",
  "ogb_status": "🛠️ Status: In Development (50% Complete)",
  "ogb_technologies": "🧰 Technologies: Flutter, Firebase, Laravel, MySQL",
  "ogb_features_heading": "Key Features:",
  "ogb_feature1": "Easy Photo Upload: Effortlessly upload photos of your items to attract potential buyers.",
  "ogb_feature2": "Real-Time Chat: Communicate directly with buyers and sellers to negotiate deals and ask questions.",
  "ogb_feature3": "Nearby Listings: Discover products from sellers in your local area for convenient pickup.",
  "ogb_feature4": "Advanced Search & Filters: Quickly find what you need by searching by keyword or category.",
  "ogb_final_note": "OGB makes buying and selling second-hand goods simple, fast, and community-driven—all in just a few taps.",
  "wasselni_section_heading": "Wasselni Delivery Application",
  "wasselni_section_subtitle": "A comprehensive overview of Wasselni, a smart and efficient delivery solution.",
  "wasselni_app_desc": "Wasselni is an intelligent delivery app that connects users with nearby drivers for fast, reliable transport of goods and parcels.",
  "wasselni_app_description": "Wasselni is an intelligent delivery app connecting users with drivers for fast, reliable transport of goods. Users can place delivery requests, track orders in real-time, and pay via cash or digital methods.",
  "wasselni_launch_date": "📅 Launch Date: August 2025",
  "wasselni_platforms": "💻 Platforms: Android, iOS",
  "wasselni_status": "🛠️ Status: In Development (90% Complete)",
  "wasselni_technologies": "🧰 Technologies: Flutter, Firebase, Laravel, MySQL, Google Maps API",
  "wasselni_development_info": "Development & Technology Stack:",
  "wasselni_development_details": "The app is built with Flutter for a seamless cross-platform experience, powered by a Laravel and Firebase backend for real-time notifications, user management, and secure data handling. Google Maps API integration enables precise location tracking and route optimization.",
  "wasselni_ui_note": "Featuring a clean user interface and dedicated dashboards for drivers and vendors, Wasselni provides a frictionless delivery experience for everyone involved.",
  "wasselni_features_heading": "Key Features:",
  "wasselni_feature1": "User, driver, and vendor registration.",
  "wasselni_feature2": "Order creation and intelligent driver assignment.",
  "wasselni_feature3": "Real-time order tracking via integrated maps.",
  "wasselni_feature4": "Instant push notifications for order updates.",
  "wasselni_feature5": "Integrated rating and review system.",
  "wasselni_feature6": "Multiple payment options (Cash on Delivery, Digital).",
  "wasselni_feature7": "Multi-language support for broader accessibility.",
  "dashboard_gallery_title": "Dashboards",
  "dashboard_gallery_description": "A look at the application's powerful dashboard interfaces.",
  "mado_section_heading": "Mado Educational Application",
  "mado_section_subtitle": "An overview of Mado's features, platform support, and development details.",
  "mado_app_desc": "Mado is an interactive educational app designed to enhance learning through subject-based organization and collaborative features.",
  "mado_app_description": "Mado is an interactive educational app designed to enhance learning through subject-based organization and collaborative features.",
  "mado_launch_date": "📅 Launch Date: September 2025",
  "mado_platforms": "💻 Platforms: Android, iOS",
  "mado_status": "🛠️ Status: In Development",
  "mado_technologies": "🧰 Technologies: Flutter",
  "mado_features_heading": "Key Features:",
  "mado_feature1": "Subject Categorization: Study materials are organized by subject, each with multiple lessons.",
  "mado_feature2": "Lesson Videos: Clear, explanatory videos accompany each lesson to simplify concepts.",
  "mado_feature3": "Practice Activities: Engaging activities to reinforce knowledge after each video.",
  "mado_feature4": "Community Interaction: Share activities and receive feedback within the Mado community.",
  "mado_feature5": "Collaborative Learning: Fosters discussion and engagement among students.",
  "mado_final_note": "Mado combines structured education with social learning, making it an ideal platform for students seeking a more engaging and collaborative study experience."
}